# Поработайте с переменными, создайте несколько,
# выведите на экран, запросите у пользователя несколько чисел и строк и
# сохраните в переменные, выведите на экран.
var_str = "Привет! Меня зовут Лена:) Я из Питера. Моё любимое число:"
var_int = 4
print(var_str, var_int)
var_joke = "Если " + str(var_int) + " умножить на " + str(var_int) + " сколько получится?"
print(var_joke)
yr_answr_1 = int(input("Введите целое число, пожалуйста: "))
print("Получится", yr_answr_1, "? А жаль - я думала, полный привод.")
print("P.S. Как же убрать пробел перед '?' после'16'?")
yr_answr_2 = input("Ваш совет: ")
print("Да?", yr_answr_2, "?")
